---
kind: property
id: P:Autodesk.Revit.DB.TableCellStyle.SheetBackgroundColor
source: html/db410d57-0515-d84b-751a-925c4d500f2c.htm
---
# Autodesk.Revit.DB.TableCellStyle.SheetBackgroundColor Property

The background color of this cell in the sheet view.

## Syntax (C#)
```csharp
public Color SheetBackgroundColor { get; }
```

## Remarks
In most cases the background color on the sheet view is the same as it is in the grid view. The background may be different
 if conditional formatting is applied only in the grid view.